p1 = input('введите пароль ')
print('повторите пароль ')
p2 = input('введите пароль ')
while p1 != p2 :
    print("различный пароль")
    print('придумайте новый  пароль ')
    p1 = input('введите пароль ')
    print('повторите пароль ')
    p2 = input('введите пароль ')
    while "123"in p1 and "password" in p1:
        print("Лёгкий пароль")
        print('придумайте новый  пароль ')
        p1 = input('введите пароль ')
        print('повторите пароль ')
        p2 = input('введите пароль ')
print('Надёжный пароль ЗАПОМНИТЕ ЕГО')
        
        
        
    
